[net]
# Testing
batch=1
subdivisions=1
# Training
# batch=64
# subdivisions=16
width=1024
height=640
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 100200
policy=steps
steps=60000,90000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

#[convolutional]
#batch_normalize=1
#filters=32
#size=3
#stride=1
#pad=1
#activation=leaky

#[maxpool]
#size=2
#stride=2

[convolutional]
batch_normalize=1
filters=32 #64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64 #128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128 #256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256 #512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=512 #1024
size=3
stride=1
pad=1
activation=leaky

###########

[convolutional]
batch_normalize=1
filters=128 #256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256 #512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=33
activation=linear



[yolo]
mask = 3,4,5
anchors = 7.1995,7.8237, 9.2805,9.7391, 10.9438,11.8730, 12.6551,13.1760, 16.5068,17.3311, 17.4831,19.3953
classes=6
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=64 #128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[reorg]
stride=2

[route]
layers = -1, 8

[convolutional]
batch_normalize=1
filters=128 #256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=33
activation=linear

[yolo]
mask = 0,1,2
anchors = 7.1995,7.8237, 9.2805,9.7391, 10.9438,11.8730, 12.6551,13.1760, 16.5068,17.3311, 17.4831,19.3953
classes=6
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
